import { SubmitKey } from "../store/config";
import { RequiredLocaleType } from "./index";

const el: RequiredLocaleType = {
  WIP: "Έρχεται σύντομα...",
  Error: {
    Unauthorized:
      "Μη εξουσιοδοτημένη πρόσβαση, παρακαλώ εισάγετε τον κωδικό πρόσβασης στη σελίδα [auth](/#/auth).",
  },
  Auth: {
    Title: "Χρειάζεται Κωδικό Πρόσβασης",
    Tips: "Παρακαλώ εισάγετε τον κωδικό πρόσβασης παρακάτω",
    Input: "κωδικός πρόσβασης",
    Confirm: "Επιβεβαίωση",
    Later: "Αργότερα",
  },
  ChatItem: {
    ChatItemCount: (count: number) => `${count} μηνύματα`,
  },
  Chat: {
    SubTitle: (count: number) => `${count} μηνύματα με το The ChatGPT`,
    Actions: {
      ChatList: "Μετάβαση στη λίστα συνομιλιών",
      CompressedHistory: "Συμπιεσμένη Ιστορία Μνήμης Prompt",
      Export: "Εξαγωγή όλων των μηνυμάτων ως Markdown",
      Copy: "Αντιγραφή",
      Stop: "Διακοπή",
      Retry: "Επανάληψη",
      Delete: "Διαγραφή",
    },
    InputActions: {
      Stop: "Διακοπή",
      ToBottom: "Στο Τελευταίο",
      Theme: {
        auto: "Αυτόματο",
        light: "Φωτεινό Θέμα",
        dark: "Σκούρο Θέμα",
      },
      Prompt: "Προτροπές",
      Masks: "Μάσκες",
      Clear: "Καθαρισμός Περιβάλλοντος",
      Settings: "Ρυθμίσεις",
    },
    Rename: "Μετονομασία Συνομιλίας",
    Typing: "Πληκτρολογώντας...",
    Input: (submitKey: string) => {
      var inputHints = `${submitKey} για αποστολή`;
      if (submitKey === String(SubmitKey.Enter)) {
        inputHints += ", Shift + Enter για αναδίπλωση";
      }
      return inputHints + ", / για αναζήτηση προτροπών";
    },
    Send: "Αποστολή",
    Config: {
      Reset: "Επαναφορά στις Προεπιλογές",
      SaveAs: "Αποθήκευση ως Μάσκα",
    },
  },
  Export: {
    Title: "Εξαγωγή Μηνυμάτων",
    Copy: "Αντιγραφή Όλων",
    Download: "Λήψη",
    MessageFromYou: "Μήνυμα Από Εσάς",
    MessageFromChatGPT: "Μήνυμα Από Το ChatGPT",
    Share: "Κοινοποίηση στο KiAsk Share",
    Format: {
      Title: "Μορφή Εξαγωγής",
      SubTitle: "Markdown ή PNG Εικόνα",
    },
    IncludeContext: {
      Title: "Συμπερίληψη Περιβάλλοντος",
      SubTitle: "Εξαγωγή προτροπών περιβάλλοντος σε μάσκα ή όχι",
    },
    Steps: {
      Select: "Επιλογή",
      Preview: "Προεπισκόπηση",
    },
  },
  Select: {
    Search: "Αναζήτηση",
    All: "Επιλογή Όλων",
    Latest: "Επιλογή Τελευταίου",
    Clear: "Καθαρισμός",
  },
  Memory: {
    Title: "Προτροπή Μνήμης",
    EmptyContent: "Τίποτα ακόμα.",
    Send: "Αποστολή Μνήμης",
    Copy: "Αντιγραφή Μνήμης",
    Reset: "Επαναφορά Συνεδρίας",
    ResetConfirm:
      "Η επαναφορά θα διαγράψει το ιστορικό συνομιλιών και την ιστορική μνήμη. Είστε σίγουροι ότι θέλετε να επαναφέρετε;",
  },
  Home: {
    NewChat: "Νέα Συνομιλία",
    DeleteChat: "Επιβεβαίωση διαγραφής της επιλεγμένης συνομιλίας;",
    DeleteToast: "Η Συνομιλία Διαγράφηκε",
    Revert: "Αναίρεση",
  },
  Settings: {
    Title: "Ρυθμίσεις",
    SubTitle: "Όλες οι Ρυθμίσεις",
    Actions: {
      ClearAll: "Καθαρισμός Όλων των Δεδομένων",
      ResetAll: "Επαναφορά Όλων των Ρυθμίσεων",
      Close: "Κλείσιμο",
      ConfirmResetAll: "Είστε σίγουροι ότι θέλετε να επαναφέρετε όλες τις ρυθμίσεις;",
      ConfirmClearAll: "Είστε σίγουροι ότι θέλετε να επαναφέρετε όλα τα δεδομένα;",
    },
    Lang: {
      Name: "Γλώσσα", // ATTENTION: if you wanna add a new translation, please do not translate this value, leave it as `Language`
      All: "Όλες οι Γλώσσες",
    },
    Avatar: "Άβαταρ",
    FontSize: {
      Title: "Μέγεθος Γραμματοσειράς",
      SubTitle: "Ρύθμιση μεγέθους γραμματοσειράς του περιεχομένου της συνομιλίας",
    },
    Update: {
      Version: (x: string) => `Έκδοση: ${x}`,
      IsLatest: "Τελευταία έκδοση",
      CheckUpdate: "Έλεγχος Ενημερώσεων",
      IsChecking: "Γίνεται έλεγχος ενημερώσεων...",
      FoundUpdate: (x: string) => `Βρέθηκε νέα έκδοση: ${x}`,
      GoToUpdate: "Ενημέρωση",
    },
    SendKey: "Κλειδί Αποστολής",
    Theme: "Θέμα",
    TightBorder: "Σφιχτό Περίγραμμα",
    SendPreviewBubble: {
      Title: "Προεπισκόπηση Αποστολής",
      SubTitle: "Προεπισκόπηση της μορφής markdown σε φυσαλίδα",
    },
    Mask: {
      Title: "Οθόνη Εκκίνησης Μάσκας",
      SubTitle: "Εμφάνιση οθόνης εκκίνησης μάσκας πριν από την έναρξη νέας συνομιλίας",
    },
    Prompt: {
      Disable: {
        Title: "Απενεργοποίηση αυτόματης συμπλήρωσης",
        SubTitle: "Εισαγωγή / για να ενεργοποιήσετε την αυτόματη συμπλήρωση",
      },
      List: "Λίστα Προτροπών",
      ListCount: (builtin: number, custom: number) =>
        `${builtin} ενσωματωμένες, ${custom} ορισμένες από τον χρήστη`,
      Edit: "Επεξεργασία",
      Modal: {
        Title: "Λίστα Προτροπών",
        Add: "Προσθήκη Μίας",
        Search: "Αναζήτηση Προτροπών",
      },
      EditModal: {
        Title: "Επεξεργασία Προτροπής",
      },
    },
    HistoryCount: {
      Title: "Πλήθος Συνημμένων Μηνυμάτων",
      SubTitle: "Αριθμός αποστελλόμενων μηνυμάτων που συνημμένα ανά αίτηση",
    },
    CompressThreshold: {
      Title: "Όριο Συμπίεσης Ιστορικού",
      SubTitle:
        "Θα συμπιέσει εάν το μήκος των μη συμπιεσμένων μηνυμάτων υπερβαίνει την τιμή",
    },
    Token: {
      Title: "Κλειδί API",
      SubTitle: "Χρησιμοποιήστε το κλειδί σας για να αγνοήσετε το όριο του κωδικού πρόσβασης",
      Placeholder: "Κλειδί OpenAI API",
    },
    Usage: {
      Title: "Υπόλοιπο Λογαριασμού",
      SubTitle(used: any, total: any) {
        return `Χρησιμοποιήθηκε αυτόν τον μήνα $${used}, συνδρομή $${total}`;
      },
      IsChecking: "Γίνεται έλεγχος...",
      Check: "Έλεγχος",
      NoAccess: "Εισαγάγετε το κλειδί API για να ελέγξετε το υπόλοιπο",
    },
    AccessCode: {
      Title: "Κωδικός Πρόσβασης",
      SubTitle: "Ενεργοποιημένος Έλεγχος Πρόσβασης",
      Placeholder: "Χρειάζεται Κωδικός Πρόσβασης",
    },
    Endpoint: {
      Title: "Σημείο Πρόσβασης",
      SubTitle: "Το προσαρμοσμένο σημείο πρόσβασης πρέπει να ξεκινά με http(s)://",
    },
    Model: "Μοντέλο",
    Temperature: {
      Title: "Θερμοκρασία",
      SubTitle: "Ένα μεγαλύτερο ποσοστό δημιουργεί πιο τυχαία αποτελέσματα",
    },
    MaxTokens: {
      Title: "Μέγιστα Tokens",
      SubTitle: "Μέγιστο μήκος εισαγωγικών tokens και δημιουργημένων tokens",
    },
    PresencePenalty: {
      Title: "Ποινή Παρουσίας",
      SubTitle:
        "Ένα μεγαλύτερο ποσοστό αυξάνει την πιθανότητα να μιλήσετε για νέα θέματα",
    },
  },
  Store: {
    DefaultTopic: "Νέα Συνομιλία",
    BotHello: "Γεια σας! Πώς μπορώ να σας βοηθήσω σήμερα;",
    Error: "Κάτι πήγε στραβά, παρακαλώ προσπαθήστε ξανά αργότερα.",
    Prompt: {
      History: (content: string) =>
        "Αυτή είναι μια περίληψη της ιστορίας συνομιλίας ως ανακεφαλαίωση: " + content,
      Topic:
        "Παρακαλώ δημιουργήστε έναν τίτλο τεσσάρων έως πέντε λέξεων που περιλαμβάνει τη συνομιλία μας χωρίς κανέναν προοίμιο, σημείο στίξης, εισαγωγικά, τελείες, σύμβολα ή επιπλέον κείμενο. Αφαιρέστε τα περικλείοντα εισαγωγικά.",
      Summarize:
        "Συνοψίστε σύντομα τη συζήτηση σε 200 λέξεις ή λιγότερο για να το χρησιμοποιήσετε ως προτροπή για μελλοντικό περιβάλλον.",
    },
  },
  Copy: {
    Success: "Αντιγράφηκε στο πρόχειρο",
    Failed: "Αποτυχία αντιγραφής, παρακαλώ επιτρέψτε την πρόσβαση στο πρόχειρο",
  },
  Context: {
    Toast: (x: any) => `Με ${x} προτροπές περιβάλλοντος`,
    Edit: "Προτροπές Περιβάλλοντος και Μνήμης",
    Add: "Προσθήκη Προτροπής",
    Clear: "Καθαρισμός Περιβάλλοντος",
    Revert: "Αναίρεση",
  },
  Plugin: {
    Name: "Πρόσθετο",
  },
  Mask: {
    Name: "Μάσκα",
    Page: {
      Title: "Πρότυπο Προτροπής",
      SubTitle: (count: number) => `${count} πρότυπα προτροπών`,
      Search: "Αναζήτηση Προτύπων",
      Create: "Δημιουργία",
    },
    Item: {
      Info: (count: number) => `${count} προτροπές`,
      Chat: "Συνομιλία",
      View: "Προβολή",
      Edit: "Επεξεργασία",
      Delete: "Διαγραφή",
      DeleteConfirm: "Επιβεβαίωση διαγραφής;",
    },
    EditModal: {
      Title: (readonly: boolean) =>
        `Επεξεργασία Προτύπου Προτροπής ${readonly ? "(μόνο για ανάγνωση)" : ""}`,
      Download: "Λήψη",
      Clone: "Κλωνοποίηση",
    },
    Config: {
      Avatar: "Άβαταρ Ρομπότ",
      Name: "Όνομα Ρομπότ",
      Sync: {
        Title: "Χρησιμοποίηση Κοινών Ρυθμίσεων",
        SubTitle: "Χρησιμοποίηση κοινών ρυθμίσεων σε αυτήν τη συνομιλία",
        Confirm: "Επιβεβαίωση υπεργραφής των προσαρμοσμένων ρυθμίσεων με τις κοινές ρυθμίσεις;",
      },
      HideContext: {
        Title: "Απόκρυψη Προτροπών Περιβάλλοντος",
        SubTitle: "Να μην εμφανίζονται οι προτροπές περιβάλλοντος στη συνομιλία",
      },
    },
  },
  NewChat: {
    Return: "Επιστροφή",
    Skip: "Απλά Ξεκινήστε",
    Title: "Επιλέξτε μια Μάσκα",
    SubTitle: "Συνομιλήστε με την Ψυχή πίσω από την Μάσκα",
    More: "Βρείτε Περισσότερα",
    NotShow: "Να μην εμφανίζεται ξανά",
    ConfirmNoShow: "Επιβεβαίωση απενεργοποίησης; Μπορείτε να το ενεργοποιήσετε αργότερα στις ρυθμίσεις.",
  },

  UI: {
    Confirm: "Επιβεβαίωση",
    Cancel: "Ακύρωση",
    Close: "Κλείσιμο",
    Create: "Δημιουργία",
    Edit: "Επεξεργασία",
  },
};

export default el;