import { SubmitKey } from "../store/config";
import { RequiredLocaleType } from "./index";

const gr: RequiredLocaleType = {
  WIP: "Έρχεται σύντομα...",
  Error: {
    Unauthorized:
      "Μη εξουσιοδοτημένη πρόσβαση, παρακαλώ εισάγετε τον κωδικό πρόσβασης στη σελίδα [auth](/#/auth).",
  },
  Auth: {
    Title: "Χρειάζεστε Κωδικό Πρόσβασης",
    Tips: "Παρακαλώ εισάγετε τον κωδικό πρόσβασης παρακάτω",
    Input: "Κωδικός πρόσβασης",
    Confirm: "Επιβεβαίωση",
    Later: "Αργότερα",
  },
  ChatItem: {
    ChatItemCount: (count: number) => `${count} μηνύματα`,
  },
  Chat: {
    SubTitle: (count: number) => `${count} μηνύματα με ChatGPT`,
    Actions: {
      ChatList: "Μετάβαση στη λίστα μηνυμάτων",
      CompressedHistory: "Αποσυμπιεσμένη Ιστορία Μνήμης Prompt",
      Export: "Εξαγωγή όλων των μηνυμάτων ως Markdown",
      Copy: "Αντιγραφή",
      Stop: "Διακοπή",
      Retry: "Επανάληψη",
      Delete: "Διαγραφή",
    },
    InputActions: {
      Stop: "Διακοπή",
      ToBottom: "Στο Τελευταίο",
      Theme: {
        auto: "Αυτόματο",
        light: "Ανοιχτό Θέμα",
        dark: "Σκούρο Θέμα",
      },
      Prompt: "Υποδείξεις",
      Masks: "Υποδείξεις",
      Clear: "Εκκαθάριση Περιβάλλοντος",
      Settings: "Ρυθμίσεις",
    },
    Rename: "Μετονομασία Συνομιλίας",
    Typing: "Πληκτρολογώντας...",
    Input: (submitKey: string) => {
      var inputHints = `${submitKey} για αποστολή`;
      if (submitKey === String(SubmitKey.Enter)) {
        inputHints += ", Shift + Enter για αλλαγή γραμμής";
      }
      return inputHints + ", / για αναζήτηση υποδείξεων";
    },
    Send: "Αποστολή",
    Config: {
      Reset: "Επαναφορά στις προεπιλογές",
      SaveAs: "Αποθήκευση ως Υπόδειξη",
    },
  },
  Export: {
    Title: "Εξαγωγή Μηνυμάτων",
    Copy: "Αντιγραφή Όλων",
    Download: "Λήψη",
    MessageFromYou: "Μήνυμα Από Εσάς",
    MessageFromChatGPT: "Μήνυμα Από το ChatGPT",
    Share: "Κοινοποίηση σε KiAsk Share",
    Format: {
      Title: "Μορφή Εξαγωγής",
      SubTitle: "Markdown ή PNG Εικόνα",
    },
    IncludeContext: {
      Title: "Συμπερίληψη Περιβάλλοντος",
      SubTitle: "Εξαγωγή υποδείξεων περιβάλλοντος",
    },
    Steps: {
      Select: "Επιλογή",
      Preview: "Προεπισκόπηση",
    },
  },
  Select: {
    Search: "Αναζήτηση",
    All: "Επιλογή Όλων",
    Latest: "Επιλογή Τελευταίου",
    Clear: "Εκκαθάριση",
  },
  Memory: {
    Title: "Υπόδειξη Μνήμης",
    EmptyContent: "Δεν υπάρχει κάτι ακόμα.",
    Send: "Αποστολή Μνήμης",
    Copy: "Αντιγραφή Μνήμης",
    Reset: "Επαναφορά Συνεδρίας",
    ResetConfirm:
      "Η επαναφορά θα διαγράψει το ιστορικό της τρέχουσας συνομιλίας και την ιστορική μνήμη. Είστε βέβαιοι ότι θέλετε να επαναφέρετε;",
  },
  Home: {
    NewChat: "Νέα Συνομιλία",
    DeleteChat: "Επιβεβαίωση διαγραφής της επιλεγμένης συνομιλίας;",
    DeleteToast: "Η Συνομιλία Διαγράφηκε",
    Revert: "Αναίρεση",
  },
  Settings: {
    Title: "Ρυθμίσεις",
    SubTitle: "Όλες οι Ρυθμίσεις",
    Actions: {
      ClearAll: "Εκκαθάριση Όλων των Δεδομένων",
      ResetAll: "Επαναφορά Όλων των Ρυθμίσεων",
      Close: "Κλείσιμο",
      ConfirmResetAll: "Είστε βέβαιοι ότι θέλετε να επαναφέρετε όλες τις ρυθμίσεις;",
      ConfirmClearAll: "Είστε βέβαιοι ότι θέλετε να εκκαθαρίσετε όλα τα δεδομένα;",
    },
    Lang: {
      Name: "Γλώσσα", // ATTENTION: if you wanna add a new translation, please do not translate this value, leave it as `Language`
      All: "Όλες οι Γλώσσες",
    },
    Avatar: "Εικόνα Avatar",
    FontSize: {
      Title: "Μέγεθος Γραμματοσειράς",
      SubTitle: "Ρύθμιση μεγέθους γραμματοσειράς του περιεχομένου συνομιλίας",
    },
    Update: {
      Version: (x: string) => `Έκδοση: ${x}`,
      IsLatest: "Τελευταία έκδοση",
      CheckUpdate: "Έλεγχος για Ενημερώσεις",
      IsChecking: "Ελέγχος ενημερώσεων...",
      FoundUpdate: (x: string) => `Βρέθηκε νέα έκδοση: ${x}`,
      GoToUpdate: "Ενημέρωση",
    },
    SendKey: "Κλειδί Αποστολής",
    Theme: "Θέμα",
    TightBorder: "Πυκνό Περίγραμμα",
    SendPreviewBubble: {
      Title: "Προεπισκόπηση Αποστολής",
      SubTitle: "Προεπισκόπηση markdown σε φυσαλίδα",
    },
    Mask: {
      Title: "Οθόνη Εκκίνησης Υποδείξεων",
      SubTitle: "Εμφάνιση οθόνης εκκίνησης υποδείξεων πριν από την έναρξη νέας συνομιλίας",
    },
    Prompt: {
      Disable: {
        Title: "Απενεργοποίηση αυτόματης συμπλήρωσης",
        SubTitle: "Εισαγωγή / για να ενεργοποιήσετε την αυτόματη συμπλήρωση",
      },
      List: "Λίστα Υποδείξεων",
      ListCount: (builtin: number, custom: number) =>
        `${builtin} ενσωματωμένες, ${custom} χρηστοποιημένες`,
      Edit: "Επεξεργασία",
      Modal: {
        Title: "Λίστα Υποδείξεων",
        Add: "Προσθήκη μίας",
        Search: "Αναζήτηση Υποδείξεων",
      },
      EditModal: {
        Title: "Επεξεργασία Υποδείξεων",
      },
    },
    HistoryCount: {
      Title: "Αριθμός Επισυναπτόμενων Μηνυμάτων",
      SubTitle: "Αριθμός αποσταλλέντων μηνυμάτων που επισυνάπτονται ανά αίτηση",
    },
    CompressThreshold: {
      Title: "Όριο Συμπίεσης Ιστορικού",
      SubTitle:
        "Θα συμπιεστεί αν το μήκος των ασυμπίεστων μηνυμάτων υπερβαίνει την τιμή",
    },
    Token: {
      Title: "Κλειδί API",
      SubTitle: "Χρησιμοποιήστε το κλειδί σας για να παραβλέψετε τον περιορισμό του κωδικού πρόσβασης",
      Placeholder: "Κλειδί OpenAI API",
    },
    Usage: {
      Title: "Υπόλοιπο Λογαριασμού",
      SubTitle(used: any, total: any) {
        return `Χρησιμοποιήθηκαν αυτόν τον μήνα $${used}, συνδρομή $${total}`;
      },
      IsChecking: "Έλεγχος...",
      Check: "Έλεγχος",
      NoAccess: "Εισαγάγετε το Κλειδί API για να ελέγξετε το υπόλοιπο",
    },
    AccessCode: {
      Title: "Κωδικός Πρόσβασης",
      SubTitle: "Ενεργοποίηση ελέγχου πρόσβασης",
      Placeholder: "Απαιτείται Κωδικός Πρόσβασης",
    },
    Endpoint: {
      Title: "Endpoint",
      SubTitle: "Το προσαρμοσμένο endpoint πρέπει να ξεκινά με http(s)://",
    },
    Model: "Μοντέλο",
    Temperature: {
      Title: "Θερμοκρασία",
      SubTitle: "Όσο μεγαλύτερη είναι η τιμή, τόσο πιο τυχαία είναι η έξοδος",
    },
    MaxTokens: {
      Title: "Μέγιστος Αριθμός Διακριτικών",
      SubTitle: "Μέγιστο μήκος εισόδου διακριτικών και παραγόμενων διακριτικών",
    },
    PresencePenalty: {
      Title: "Ποινή Παρουσίας",
      SubTitle:
        "Όσο μεγαλύτερη είναι η τιμή, τόσο πιο πιθανό είναι να μιλήσει για νέα θέματα",
    },
  },
  Store: {
    DefaultTopic: "Νέα Συνομιλία",
    BotHello: "Γεια! Πώς μπορώ να σας βοηθήσω σήμερα;",
    Error: "Κάτι πήγε στραβά, παρακαλώ δοκιμάστε ξανά αργότερα.",
    Prompt: {
      History: (content: string) =>
        "Αυτό είναι ένα σύνολο του ιστορικού της συνομιλίας ως ανακεφαλαίωση: " + content,
      Topic:
        "Παρακαλώ δημιουργήστε έναν τίτλο από τέσσερις έως πέντε λέξεις για να περιγράψετε τη συνομιλία μας χωρίς κείμενο εισαγωγής, σημεία στίξης, εισαγωγικά, τελείες, σύμβολα ή πρόσθετο κείμενο. Αφαιρέστε τα περικλείοντα εισαγωγικά.",
      Summarize:
        "Περιγράψτε συνοπτικά τη συζήτηση σε 200 λέξεις ή λιγότερο ως υπόδειξη για μελλοντικό πλαίσιο.",
    },
  },
  Copy: {
    Success: "Αντιγράφηκε στο πρόχειρο",
    Failed: "Αποτυχία αντιγραφής, παρακαλώ επιτρέψτε την πρόσβαση στο πρόχειρο",
  },
  Context: {
    Toast: (x: any) => `Με ${x} περιβαλλοντικές υποδείξεις`,
    Edit: "Υποδείξεις Περιβάλλοντος και Μνήμης",
    Add: "Προσθήκη Υποδείξεων",
    Clear: "Εκκαθάριση Περιβάλλοντος",
    Revert: "Αναίρεση",
  },
  Plugin: {
    Name: "Πρόσθετο",
  },
  Mask: {
    Name: "Υπόδειξη",
    Page: {
      Title: "Πρότυπο Υποδείξεων",
      SubTitle: (count: number) => `${count} πρότυπα υποδείξεων`,
      Search: "Αναζήτηση Προτύπων",
      Create: "Δημιουργία",
    },
    Item: {
      Info: (count: number) => `${count} υποδείξεις`,
      Chat: "Συνομιλία",
      View: "Προβολή",
      Edit: "Επεξεργασία",
      Delete: "Διαγραφή",
      DeleteConfirm: "Επιβεβαίωση διαγραφής;",
    },
    EditModal: {
      Title: (readonly: boolean) =>
        `Επεξεργασία Προτύπου Υποδείξεων ${readonly ? "(μόνο για ανάγνωση)" : ""}`,
      Download: "Λήψη",
      Clone: "Κλώνος",
    },
    Config: {
      Avatar: "Avatar Ρομπότ",
      Name: "Όνομα Ρομπότ",
      Sync: {
        Title: "Χρήση Κοινόπολων Ρυθμίσεων",
        SubTitle: "Χρήση κοινόπολων ρυθμίσεων σε αυτήν τη συνομιλία",
        Confirm: "Επιβεβαίωση Αντικατάστασης Προσαρμοσμένων Ρυθμίσεων με Κοινόπολες Ρυθμίσεις;",
      },
      HideContext: {
        Title: "Απόκρυψη Υποδείξεων Περιβάλλοντος",
        SubTitle: "Να μην εμφανίζονται υποδείξεις περιβάλλοντος στη συνομιλία",
      },
    },
  },
  NewChat: {
    Return: "Επιστροφή",
    Skip: "Απλά Ξεκινήστε",
    Title: "Επιλέξτε μια Υπόδειξη",
    SubTitle: "Συνομιλήστε με την Ύπαρξη πίσω από την Υπόδειξη",
    More: "Βρείτε περισσότερες",
    NotShow: "Να μην εμφανιστεί ξανά",
    ConfirmNoShow: "Επιβεβαίωση απενεργοποίησης; Μπορείτε να το ενεργοποιήσετε αργότερα στις ρυθμίσεις.",
  },

  UI: {
    Confirm: "Επιβεβαίωση",
    Cancel: "Ακύρωση",
    Close: "Κλείσιμο",
    Create: "Δημιουργία",
    Edit: "Επεξεργασία",
  },
};

export default gr;
